{"_id":{"$oid":"641687b2a58669a90bb3bb5f"},"code":"COP 3502C","name":"Programming Fundamentals 1","description":"First course of a two-semester introductory sequence for those planning further study in computer science, digital arts and sciences or computer engineering. Concepts of computer science and the process of computer programming, including object-oriented programming, procedural and data abstraction and program modularity.","website":"","credits":"4","prerequisites":"MAC 2311","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb60"},"code":"COP 3503C","name":"Programming Fundamentals 2","description":"Second course of a two-semester introductory sequence for those planning further study in computer science, digital arts and sciences or computer engineering. Concepts of computer science and the process of computer programming, including object-oriented programming, procedural and data abstraction and program modularity.","website":"","credits":"4","prerequisites":"COP 3502 or AP exam in computer science with a 4 and MAC 2311","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb61"},"code":"COP 3504C","name":"Advanced Programming Fundamentals for CIS Majors","description":"Students may opt to take COP 3504C in lieu of COP 3502C and COP 3503C. Fast-paced introduction to computer science for those with prior programming experience. Explores major concepts of computer science and the process of computer programming, including object-oriented programming, procedural and data abstraction and program modularity.","website":"","credits":"4","prerequisites":"MAC 2311 or MAC 3472 and programming experience","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb62"},"code":"COP 3530","name":"Data Structures and Algorithm","description":"Algorithm development using pseudo languages, basic program structures, program design techniques, storage and manipulation of basic data structures like arrays, stacks, queues, sorting and searching and string processing. Linked linear lists. Trees and multilinked structures.","website":"","credits":"3","prerequisites":"COP 3504 or COP 3503, and COT 3100, and MAC 2234 or MAC 2312 or MAC 2512 or MAC 3473","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb63"},"code":"COP 4600","name":"Operating Systems","description":"Design and implementation of various components of a modern operating system, including I/O programming, interrupt handling, process and resource management, computer networks and distributed systems.","website":"","credits":"3","prerequisites":"CDA 3101 and COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb64"},"code":"COT 3100","name":"Applications of Discrete Structures","description":"Covers the mathematics of discrete events; i.e., events that involve distinct elements, finite structures of distinct elements or finite sampled versions of continuous phenomena (such as movement).","website":"","credits":"3","prerequisites":"MAC 2311 or MAC 3472 and COP 3502 or equivalent","corequisites":"COP 3504 or COP 3503"}
{"_id":{"$oid":"641687b2a58669a90bb3bb65"},"code":"CDA 3101","name":"Introduction to Computer Organization","description":"Organization of computing systems. Logical basis of computer structure. Machine representation of instructions and data, flow of control, and basic machine instructions. Assembly language programming.","website":"","credits":"3","prerequisites":"COP 3504 or COP 3503, and MAC 2233 or MAC 2311 or MAC 3472, and COT 3100","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb66"},"code":"CEN 3031","name":"Introduction to Software Engineering","description":"Topics include software planning, specifications, coding, testing and maintenance. Gain experience in the team approach to large system development.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb67"},"code":"CIS 4301","name":"Information and Database Systems 1","description":"First part of a two-course sequence that studies the essential concepts, principles and techniques of modern database systems. Topics include modeling and querying of data using conceptual data models as well as the development of a database application.","website":"","credits":"3","prerequisites":"COP 3504 or COP 3503 and COT 3100","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb68"},"code":"CIS 4914","name":"Senior Project","description":"Involves completing a significant CISE-related project. Coordinate with the instructor and a project advisor, prepare a detailed technical report and deliver an oral presentation.","website":"","credits":"3","prerequisites":"Senior standing and approved project proposal","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb69"},"code":"CNT 4007","name":"Computer Network Fundamentals","description":"Fundamental concepts, principles, and standards of computer networks. Introduces topics in top-down approach, starting with the application layer in the OSI system architecture with a stronger focus on application, transport, and network layers.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":"COP 4600"}
{"_id":{"$oid":"641687b2a58669a90bb3bb6a"},"code":"COP 4020","name":"Programming Language Concepts","description":"Introduces programming language principles, including language constructs, design goals, run-time structures, implementation techniques and exposure to a wide variety of programming paradigms.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb6b"},"code":"COP 4533","name":"Algorithm Abstraction and Design","description":"Covers algorithmic concepts and their use rooted in practical application and computer science theory. Topics include algorithmic paradigms, limits of computing, and algorithm time complexity classes.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb6c"},"code":"EGS 4034","name":"Engineering Ethics and Professionalism","description":"Provides students with an interactive study of ethical theory and the development of professionalism. Students review case studies of ethical conflicts in engineering practice. Course covers engineering codes of ethics and requires students to resolve theoretical situations through application of ethical codes.","website":"","credits":"1","prerequisites":"Junior level standing ","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb6d"},"code":"CGS 3065","name":"Legal and Social Issues in Computing","description":"Students may opt to take CGS 3065 instead of EGS 4034. Explores the history, the myth, the ethics, the law and the risks of computer-based technology in modern society. Emphasizes critical analysis of hypotheticals and case studies. Published material is supplemented with online references.","website":"","credits":"3","prerequisites":"Previous experience in Unix environment","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb6e"},"code":"ENC 3246","name":"Professional Communication for Engineers","description":"Students master a variety of communication strategies and genres of writing relevant to engineering, such as composing email, memos, letters, technical descriptions, instructions, academic research reports and professional proposals. Students also respond to complex rhetorical situations, thus preparing for work in their professional communities.","website":"","credits":"3","prerequisites":"ENC 1101 or ENC 1102","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb6f"},"code":"MAC 2311","name":"Analytic Geometry and Calculus 1","description":"Introduces analytic geometry; limits; continuity; differentiation of algebraic, trigonometric, exponential and logarithmic functions; applications of the derivative; inverse trigonometric functions; differentials; introduction to integration; and the fundamental theorem of calculus.","website":"","credits":"4","prerequisites":"Minimal acceptable score on the online mathematics placement exam; a grade of C in a MAC course numbered 1147 or higher; AP credit for MAC 2311; IB credit for a MAC course numbered 1147 or higher","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb70"},"code":"MAC 2312","name":"Analytic Geometry and Calculus 2","description":"Techniques of integration; applications of integration; differentiation and integration of inverse trigonometric, exponential and logarithmic functions; sequences and series.","website":"","credits":"4","prerequisites":"MAC 2311 or MAC 3472","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb71"},"code":"MAC 2313","name":"Analytic Geometry and Calculus 3","description":"Solid analytic geometry, vectors, partial derivatives and multiple integrals.","website":"","credits":"4","prerequisites":"MAC 2312 or MAC 2512 or MAC 3473","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb72"},"code":"MAS 3114","name":"Computational Linear Algebra","description":"Linear equations, matrices and determinants. Vector spaces and linear transformations. Inner products and eigenvalues. Emphasizes computational aspects of linear algebra.","website":"","credits":"3","prerequisites":"MAC 2312, MAC 2512, OR MAC 3473","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb73"},"code":"PHY 2048","name":"Physics with Calculus 1","description":"The first of a two-semester sequence of physics for scientists and engineers. The course covers Newtonian mechanics and includes motion, vectors, Newton's laws, work and conservation of energy, systems of particles, collisions, equilibrium, oscillations and waves.","website":"","credits":"3","prerequisites":"High school physics, PHY 2020 or equivalent, and MAC 2311","corequisites":"MAC 2312"}
{"_id":{"$oid":"641687b2a58669a90bb3bb74"},"code":"PHY 2048L","name":"Laboratory for Physics with Calculus 1","description":"Laboratory experience for PHY 2048 illustrating the practical applications of Newtonian mechanics.","website":"","credits":"1","prerequisites":"Degree-seeking student","corequisites":"PHY 2048 or equivalent"}
{"_id":{"$oid":"641687b2a58669a90bb3bb75"},"code":"PHY 2049","name":"Physics with Calculus 2","description":"The second of a two-semester sequence of physics for scientists and engineers. Content includes Coulomb's law, electric fields and potentials, capacitance, currents and circuits, Ampere's law, Faraday's law, inductance, Maxwell's equations, electromagnetic waves, ray optics, interference and diffraction.","website":"","credits":"3","prerequisites":"PHY 2048 and MAC 2312","corequisites":"MAC 2313"}
{"_id":{"$oid":"641687b2a58669a90bb3bb76"},"code":"PHY 2049L","name":"Laboratory for Physics with Calculus 2","description":"Laboratory experience for PHY 2049 illustrating the practical applications of Coulomb's law, electric fields and potentials, capacitance, currents and circuits, Ampere's law, Faraday's law, inductance, Maxwell's equations, electromagnetic waves, ray optics, interference and diffraction.","website":"","credits":"1","prerequisites":"Degree-seeking student","corequisites":"PHY 2049 or equivalent"}
{"_id":{"$oid":"641687b2a58669a90bb3bb77"},"code":"STA 3032","name":"Engineering Statistics","description":"The basic concepts in probability and statistics with engineering applications. Topics include probability, discrete and continuous random variables, estimation, hypothesis testing, and linear and multiple regression.","website":"","credits":"3","prerequisites":"MAC 2311","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb78"},"code":"CAP 3020","name":"Theory and Practice of Multimedia Production","description":"Combines the traditional media production pipeline and software engineering processes to synthesize an approach geared for the production of works incorporating both artistic and computational elements.","website":"","credits":"3","prerequisites":"CAP 3027","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb79"},"code":"CAP 3027","name":"Introduction to Digital Arts and Sciences","description":"Synergy between art and computing through a programming-oriented exploration of fundamental concepts in multimedia.","website":"","credits":"3","prerequisites":"COP 3504 or COP3503","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb7a"},"code":"CAP 3032","name":"Interactive Modeling and Animation 1","description":"Introduces programming and data structures for interactive two-dimensional multimedia applications. Representing form and transforms in two dimensions, capturing user actions and driving application behavior interactively. Graphical interfaces, image processing, automata and basic artificial intelligence.","website":"","credits":"3","prerequisites":"MAC 1147 or equivalent","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb7b"},"code":"CAP 3034 ","name":"Introduction to Computer-Aided Animation","description":"Introduces topics related to computer-aided animation. Rigging for forward and inverse kinematics. Skin weighting. Morph targets. Expression-driven animation, rigid-body and particle simulation.","website":"","credits":"3","prerequisites":"MAC 1147 or equivalent","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb7c"},"code":"CAP 3220","name":"Introduction to Computer-Aided Modeling","description":"Introduces topics related to computer-aided modeling. Polygonal mesh, NURBS and subdivision surface meshes. Materials and shading networks. Lighting, shadows and rendering.","website":"","credits":"3","prerequisites":"MAC 1147 or equivalent","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb7d"},"code":"CAP 4053","name":"Artificial Intelligence for Computer Games","description":"Examines the use of A.I. in computer games. Topics include general A.I. knowledge, path finding, movement, tactics and planning, strategy, state machines, learning, dialogue, and emotions.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb7e"},"code":"CAP 4112","name":"Generating Expressiveness in Intelligent Agents and Avatars","description":"Methods to create expressiveness in physical and virtual agents; anthropomorphism and interactivity in human-robot interaction; intent versus intelligence; affect, emotion, and personality; expressiveness in human-like agents versus nonhuman-like agents; uncanny valley effect.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb7f"},"code":"CAP 4136","name":"Malware Reverse Engineering","description":"Introduction to the theory and practice of software reverse engineering applied to the analysis of malicious software (malware). Students will learn techniques of static and dynamic analysis to help identify the full spectrum of the behavior of code that is presented without documentation or source code and to identify possible remediation and avoidance techniques. The course will use a large number of software tools employed by malware and computer forensic analysts.","website":"","credits":"3","prerequisites":"CDA 3101 or instrutor permission","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb80"},"code":"CAP 4613","name":"Deep Learning for Computer Graphics","description":"Covers deep learning basics, related math and the fundamental theory and application of AI algorithms most popular in the field of computer graphics. Programming assignments will help students develop GPU programming skills while implementing concepts learned in lectures and readings using deep learning APIs on a GPU cluster. Convolutional neural networks (CNNs) for colorizing black and white movies is an example.","website":"","credits":"3","prerequisites":"COP 3530 or MAS 3114 or MAS 4105","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb81"},"code":"CAP 4621","name":"Artificial Intelligence and Heuristics","description":"Introduces artificial intelligence concepts. Heuristic search, clause form logic, knowledge representation, reasoning and inference, overview of computer vision, planning, natural language, Lisp and Prolog.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb82"},"code":"CAP 4641","name":"Natural Language Processing","description":"Introduction to the essential concepts, principles, and techniques of Natural Language Processing (NLP). Practical application and theoretical concepts are examined. Topics include information extraction, language construction, grammars, disambiguation, as well as system modeling, classification, and evaluation.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb83"},"code":"CAP 4730","name":"Computational Structures in Computer Graphics","description":"Studies the major topics in computer graphics: display and output technology, two and three dimensional manipulations; space curves and surfaces, hidden surface removal and shading models.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb84"},"code":"CAP 4770","name":"Introduction to Data Science","description":"Introduces the basics of data science including programming for data analytics, file management, relational databases, classification, clustering, and regression; lays the foundation for big data applications ranging from social networks to medical and business informatics.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb85"},"code":"CDA 4102","name":"Computer Architecture","description":"Introduces computer architecture and system organization including virtual memory supports cache, pipeline, vector processing, multiprocessor and RISC architecture.","website":"","credits":"3","prerequisites":"CDA 3101 and COP3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb86"},"code":"CDA 4630","name":"Embedded Systems","description":"Design of efficient and trustworthy embedded and cyber-physical systems consisting of hardware, software, firmware, sensors, and actuators. Covers fundamental issues related to modeling and specification, design space exploration, hardware-software partitioning, synthesis and compilation, real-time operating systems, and application-specific optimizations targeting area, power, performance, temperature, energy, and security.","website":"","credits":"3","prerequisites":"CDA 3101","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb87"},"code":"CEN 3907C","name":"Computer Engineering Design 1","description":"Reinforce basic computer engineering skills; design, produce, and report on a computer engineering project, meeting defined specifications and using a structured design methodology and project management.","website":"","credits":"3","prerequisites":"CEN 3031 and EEL 3744C","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb88"},"code":"CEN 3908C","name":"Computer Engineering Design 2","description":"Selected capstone design projects involving engineering applications in the various areas of computer engineering. Must be taken prior to the semester of graduation .","website":"","credits":"3","prerequisites":"CEN 3907C and senior standing","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb89"},"code":"CEN 3913","name":"Computer and Information Science and Engineering Design","description":"Preparatory skills are developed for CISE Design 2 for Computer Engineering students. Teams design, produce and report on a software prototype, meeting defined specifications and using a structured design methodology and project management.","website":"","credits":"3","prerequisites":"CEN 3031","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb8a"},"code":"CEN 4072","name":"Software Testing and Verification","description":"Concepts, principles and techniques of software testing and verification. Strengths and limitations of black-box and white-box testing methods; techniques for proving the correctness of programs.","website":"","credits":"3","prerequisites":"CEN 3031","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb8b"},"code":"CEN 4721","name":"Human-Computer Interaction","description":"Studies the major topics in the study, planning and design of the interaction between people and computers. Topics include interface design (principles, theories and guidelines), virtual environments, interactive devices and collaboration.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb8c"},"code":"CEN 4722","name":"User Experience Design","description":"Introduces methods and tools used in User Experience Design (UXD): the early stages of software design focused on meeting user needs. Key concepts include user research, contextual design, design thinking, ideation, iterative design, prototyping, and design documentation. Projects utilize software tools used in the industry.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb8d"},"code":"CEN 4725","name":"Natural User Interaction","description":"Introduces the design, development and evaluation of Natural User Interaction (NUI) technologies (e.g., non-keyboard and mouse technologies such as touchscreen interaction, gesture interaction, speech interaction, etc.). Discussion of the hardware-to-software NUI pipeline and key considerations when developing NUI software, including existing platforms, toolkits and APIs used to create NUI software.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb8e"},"code":"CEN 4914","name":"Computer and Information Science and Engineering Design 2","description":"Involves completing a significant CEN-related project. Coordinate with the instructor and a project advisor, prepare a detailed technical report and deliver an oral presentation.","website":"","credits":"3","prerequisites":"CEN 3913","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb8f"},"code":"CGS 2032","name":"Math, Art and Computing","description":"Introduces interdisciplinary computer science topics. Logic, discrete structures, algorithms and automa. Exploration of topics relating mathematics and computing to art, music and nature. ","website":"","credits":"3","prerequisites":"MAC 1147","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb90"},"code":"CGS 3063","name":"Computers and Modern Society","description":"Impact of computers on society. Discussion includes specific cases from many areas, but does not include problem solution. Does not teach how to use the computer but gives an understanding of the implications of computers.","website":"","credits":"3","prerequisites":"N/A","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb91"},"code":"CGS 3065","name":"Legal and Social Issues in Computing","description":"Explores the history, the myth, the ethics, the law and the risks of computer-based technology in modern society. Emphasizes critical analysis of hypotheticals and case studies. Published material is supplemented with online references.","website":"","credits":"3","prerequisites":"Previous experience in Unix environment","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb92"},"code":"CGS 4144","name":"Introduction to Bioinformatic Algorithms","description":"Uses Compeau and Pevzner’s active learning approach from their textbook, Bioinformatics Algorithms, to cover fundamental topics in genomics, machine learning, and biological data science, striking a unique balance between practical challenges in modern biology and fundamental algorithmic ideas.","website":"","credits":"3","prerequisites":"COT 3100 and COP 3503","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb93"},"code":"CIS 4204","name":"Penetration Testing: Ethical Hacking","description":"Introduces principles and techniques associated with the cybersecurity practice known as penetration testing or ethical hacking. Covers planning, reconnaissance, scanning, exploitation, post-exploitation, and result reporting. Discover how system vulnerabilities can be exploited and learn to avoid such problems.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb94"},"code":"CIS 4213","name":"Enterprise Security","description":"Provides an introduction to the real-world aspects of defending an enterprise network. Students will gain hands-on experience performing system security tasks and handling incidents. The class begins with a basic introduction to enterprise cybersecurity, the attack sequence, and managing cybersecurity. Then lecture, homework and lab activities cover the center for internet security's twenty essential security controls.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb95"},"code":"CIS 4360","name":"Computer and Information Security","description":"Covers systematic threat and risk assessment; programmed threats and controls in hardware, software, and human procedures; security policies, models, and mechanisms; theoretical limitations and practical implementations; certification and accreditation standards; and case study reviews. Includes projects.","website":"","credits":"3","prerequisites":"COP 4600","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb96"},"code":"CIS 4362","name":"Introduction to Cryptology","description":"Introduces classical and modern cryptography and cryptanalysis, including symmetric and asymmetric (public key) ciphers. Covers cryptographic hash functions, block and stream ciphers, as well as differential and linear cryptanalysis. Reviews applications of cryptography, cryptographic standards and protocols, and analyzes case studies of failed implementations.","website":"","credits":"3","prerequisites":"COT 3100","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb97"},"code":"CIS 4715","name":"CS Teaching & Learning","description":"Covers basic pedagogy, especially as it relates to computer science and engineering, and covers three fundamental elements in education: learning environment, educational theory, and educational practice as approached to engineering-specific training.","website":"","credits":"0-1","prerequisites":"COP 3502","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb98"},"code":"CIS 4905","name":"Individual Study in CISE","description":"Problems in different areas of computer science.","website":"","credits":"1-4","prerequisites":"N/A","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb99"},"code":"CIS 4912C","name":"Integrated Product and Process Design 1","description":"First part of a two-course sequence where teams of engineering and business students partner with industry sponsors to design and build authentic products and processes. Working closely with an industry liaison engineer and a faculty coach, students gain practical experience in teamwork and communication, problem solving and engineering design, and develop leadership, management and people skills. Weekly workshop activities adapt lecture topics to individual projects. Learn firsthand how to develop products and processes that meet customer requirements on time and within budget.","website":"","credits":"3","prerequisites":"CDA 3101, COP 3530, COT 3100, and instructor permission","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb9a"},"code":"CIS 4913C","name":"Integrated Product and Process Design 2","description":"Second part of a sequence where teams of engineering and business students partner with industry sponsors to design and build authentic products and processes.","website":"","credits":"3","prerequisites":"CIS 4912C","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb9b"},"code":"CIS 4930","name":"Special Toipcs in CISE","description":"Variable content provides an opportunity for in-depth study of topics not offered elsewhere and of topics of current significance.","website":"","credits":"1-4","prerequisites":"COP 3503 or instructor permission","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb9c"},"code":"CIS4940","name":"Practical Work","description":"One term practical software engineering work under industrial supervision as set forth in the Herbert Wertheim College of Engineering regulations. ","website":"","credits":"1","prerequisites":"N/A","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb9d"},"code":"CIS 4949","name":"Co-Op Work in CISE","description":"Practical engineering work under industrial supervision, as set forth in the Herbert Wertheim College of Engineering regulations. ","website":"","credits":"1","prerequisites":"N/A","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb9e"},"code":"CIS 4956","name":"Overseas Studies 1","description":"Provides a mechanism by which coursework taken as part of an approved study abroad program can be recorded on the UF transcript and counted toward graduation.","website":"","credits":"1-15","prerequisites":"Undergraduate advisor permission","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bb9f"},"code":"CNT 4520","name":"Introduction to Mobile Networking","description":"Fundamental concepts of emerging mobile networks architecture, systematic analysis of effects of mobility on network performance, synthetic and data-driven mobility modeling and simulation, behavior analysis in mobile networks, mobile service and application structure, development, implementation, and evaluation. Topics include architecture, geographic routing and query resolution in ad hoc networks, sensor networks, Internet of Things, and vehicular networks.","website":"","credits":"3","prerequisites":"COP 3502C or COP 3503C or above","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba0"},"code":"CNT 4731","name":"Multimedia Networking Principles","description":"Design and analysis of multimedia networking. Major effort is devoted on multimedia elements, and their impact on higher-level protocols at the application- and transport-layer.","website":"","credits":"3","prerequisites":"CNT 4007","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba1"},"code":"COP 2271","name":"Computer Programming for Engineers","description":"Computer programming and the use of computers to solve engineering and mathematical problems. Emphasizes applying problem solving skills; directed toward technical careers in fields employing a reasonably high degree of mathematics. The programming language used depends on the demands of the departments in the college. Several languages may be taught each semester, no more than one per section. Those required to learn a specific language must enroll in the correct section.","website":"","credits":"2","prerequisites":"MAC 2312","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba2"},"code":"COP 2800","name":"Computer Programming Using JAVA","description":"In-depth treatment of computer programming using JAVA. Problems related to a variety of disciplines are solved. Introduces the basic concepts of software and hardware; develop a variety of stand-alone applications and applets. For non-CISE majors only.","website":"","credits":"3","prerequisites":"MAC 1147 or equivalent","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba3"},"code":"COP 3275","name":"Computer Programming Using C","description":"Solve problems related to a variety of disciplines; introduces the basic concepts of software and hardware.","website":"","credits":"3","prerequisites":"MAC 1147 or equivalent","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba4"},"code":"COP 4331","name":"Object-oriented Programming","description":"Fundamental conceptual models for programming languages illustrated with specific programming languages and application problems. Specific topics include class and object models, inheritance among classes, objects and static and dynamic systems and implementations.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba5"},"code":"COP 4620","name":"Translators and Translator Writing Systems","description":"Translation of languages, scanning and parsing techniques. Translator writing systems. The implementation of a compiler.","website":"","credits":"3","prerequisites":"COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba6"},"code":"COP 4720","name":"Information and Database Systems 2","description":"Part two of a two-course sequence. Provides a basic understanding of the internals of a modern database system. Topics include data storage, indexing, query processing and advanced concepts such as database tuning, alternate data models and emerging applications. ","website":"","credits":"3","prerequisites":"CIS 4301 and COP 3530","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba7"},"code":"COT 4501","name":"Numerical Analysis: a Computational Approach","description":"Numerical integration, nonlinear equations, linear and nonlinear systems of equations, differential equations and interpolation.","website":"","credits":"3","prerequisites":"COP 3504 or COP 3503 and MAS 3114","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba8"},"code":"EGN 4912","name":"Engineering Directed Independent Research","description":"Provides firsthand, supervised research with a faculty advisor or postdoctoral or graduate student mentor. Projects may involve inquiry, design, investigation, scholarship, discovery or application.","website":"","credits":"0-3","prerequisites":"N/A","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bba9"},"code":"EGS 1005","name":"Prep for Success","description":"Freshman success course that includes academic preparation in calculus, chemistry, student success and technical communications.","website":"","credits":"1-4","prerequisites":"EG student","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bbaa"},"code":"IDC 4710","name":"Virtual Reality for the Social Good","description":"Multidisciplinary approach to solving pressing social problems by blending social science practices with innovative technology. Explore effective messaging perspectives, virtual social spaces, and virtual reality technologies to create a compelling story for a social good issue. Open to all juniors and seniors, regardless of major or prior experience.","website":"","credits":"3","prerequisites":"Junior or above","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bbab"},"code":"EGN 4951","name":"Integrated Product and Process Design 1","description":"A two-semester-course sequence in which multidisciplinary teams of engineering students partner with industry sponsors to design and build authentic products and processes—on time and within budget. Working closely with industry liaison engineers and a faculty coach, students gain practical experience in teamwork and communication, problem solving and engineering design, and develop leadership, management and people skills.","website":"","credits":"3","prerequisites":"CDA 3101, COP 3530, COT 3100, and instructor permission","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bbac"},"code":"EGN 4952","name":"Integrated Product and Process Design 2","description":"A two-semester-course sequence in which multidisciplinary teams of engineering and business students partner with industry sponsors to design and build authentic products and processes—on time and within budget. Working closely with industry liaison engineers and a faculty coach, students gain practical experience in teamwork and communication, problem solving and engineering design, and develop leadership, management and people skills.","website":"","credits":"3","prerequisites":"EGN 4951","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bbad"},"code":"EIN 3354","name":"Engineering Economy","description":"Basic principles and applications of economic decision-making between alternatives encountered in engineering systems projects. Analysis includes methodologies of economics and finance in addition to engineering fundamentals.","website":"","credits":"3","prerequisites":"MAC 2312","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bbae"},"code":"EEL 3701C","name":"Digital Logic and Computer Systems","description":"Overview of logic design, algorithms, computer organization and assembly language programming and computer engineering technology. Laboratory.","website":"","credits":"4","prerequisites":"Knowledge of programming language","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bbaf"},"code":"EEL 4744C","name":"Microprocessor Applications","description":"Experience in the elements of microprocessor-based systems, hardware interfacing and software design for their application. Laboratory.","website":"","credits":"4","prerequisites":"EEL 3701C and EEL 3834 or COP3503C or COP 3504C or COP 2274 or equivalent","corequisites":""}
{"_id":{"$oid":"641687b2a58669a90bb3bbb0"},"code":"CIS 4940","name":"Practical Work","description":"One term practical software engineering work under industrial supervision as set forth in the Herbert Wertheim College of Engineering regulation.","website":"","credits":"1","prerequisites":"N/A","corequisites":""}